tap "coder/coder"
tap "hashicorp/tap"
brew "awscli"
brew "bash-language-server"
brew "docker-language-server"
brew "dockerfile-language-server"
brew "gh"
brew "git"
brew "helm"
brew "helm-ls"
brew "htop"
brew "kube-ps1"
brew "kubectx"
brew "kubelogin"
brew "lua-language-server"
brew "marksman"
brew "neovim"
brew "pyright"
brew "python@3.10"
brew "python-tk@3.10"
brew "python@3.11"
brew "python-tk@3.11"
brew "python-tk@3.13"
brew "python@3.14"
brew "rclone"
brew "restic"
brew "terminal-notifier"
brew "tmux"
brew "typescript-language-server"
brew "uv"
brew "vscode-langservers-extracted"
brew "wget"
brew "yaml-language-server"
brew "hashicorp/tap/terraform"
cask "codex"
cask "font-jetbrains-mono-nerd-font"
vscode "bierner.markdown-mermaid"
vscode "coder.coder-remote"
vscode "continue.continue"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "visualstudiotoolsforunity.vstuc"
